


NETEXT WG                                             S. Gundavelli, Ed.
Internet-Draft                                                     Cisco
Intended status: Standards Track                        J. Korhonen, Ed.
Expires: January 17, 2013                         Nokia Siemens Networks
                                                              M. Grayson
                                                                K. Leung
                                                           R. Pazhyannur
                                                                   Cisco
                                                           July 16, 2012


      Access Network Identifier (ANI) Option for Proxy Mobile IPv6
             draft-ietf-netext-access-network-option-11.txt

Abstract

   The local mobility anchor in a Proxy Mobile IPv6 domain is able to
   provide access network and access operator specific handling or
   policing of the mobile node traffic using information about the
   access network to which the mobile node is attached.  This
   specification defines a mechanism and a related mobility option for
   carrying the access network identifier and the access operator
   identification information from the mobile access gateway to the
   local mobility anchor over Proxy Mobile IPv6.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on January 17, 2013.

Copyright Notice

   Copyright (c) 2012 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal



Gundavelli, et al.      Expires January 17, 2013                [Page 1]

Internet-Draft      Access Network Identifier Option           July 2012


   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Conventions and Terminology  . . . . . . . . . . . . . . . . .  4
     2.1.  Conventions  . . . . . . . . . . . . . . . . . . . . . . .  4
     2.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  Access Network Identifier Option . . . . . . . . . . . . . . .  5
     3.1.  Format of the Access Network Identifier Sub-Option . . . .  6
       3.1.1.  Network-Identifier Sub-Option  . . . . . . . . . . . .  6
       3.1.2.  Geo-Location ANI Sub-Option  . . . . . . . . . . . . .  8
       3.1.3.  Operator-Identifier Sub-Option . . . . . . . . . . . .  9
   4.  Protocol Considerations  . . . . . . . . . . . . . . . . . . . 10
     4.1.  Mobile Access Gateway Considerations . . . . . . . . . . . 10
     4.2.  Local Mobility Anchor Considerations . . . . . . . . . . . 12
   5.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 13
   6.  Protocol Configuration Variables . . . . . . . . . . . . . . . 14
   7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 16
   8.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 16
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 16
     9.1.  Normative References . . . . . . . . . . . . . . . . . . . 16
     9.2.  Informative References . . . . . . . . . . . . . . . . . . 17
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 17



















Gundavelli, et al.      Expires January 17, 2013                [Page 2]

Internet-Draft      Access Network Identifier Option           July 2012


1.  Introduction

   Proxy mobile IPv6 [RFC5213] can be used for supporting network-based
   mobility management in various type of network deployments.  The
   network architectures, such as Service provider Wi-Fi access
   aggregation or, WLAN integrated mobile packet core are examples where
   Proxy Mobile IPv6 is a component of the overall architecture.  Some
   of these architectures require the ability of the local mobility
   anchor (LMA) [RFC5213] to provide differentiated services and
   policing of traffic to the mobile nodes based on the access network
   to which they are attached.  Policy systems in mobility architectures
   such as Policy and Charging Control Framework (PCC) [TS23203] and
   Access Network Discovery and Selection Function (ANDSF) [TS23402] in
   3GPP system allow configuration of policy rules with conditions based
   on the access network information.  For example, the service
   treatment for the mobile node's traffic may be different when they
   are attached to a access network owned by the home operator than when
   owned by a roaming partner.  The service treatment can also be
   different based on the configured Service Set Identifiers (SSID) in
   case of IEEE 802.11 based access networks.  Other examples of
   location services include the operator's ability to display a
   location specific web page, or apply tariff based on the location.

   The Proxy Mobile IPv6 specification [RFC5213] requires the Access
   Technology Type (ATT) option to be carried in from the mobile access
   gateway (MAG) to the local mobility anchor.  This is a mandatory
   option.  However, the Access Technology Type alone is not necessarily
   sufficient for a suitable policy to be applied at the local mobility
   anchor.  Therefore, there is a need for additional access network
   related information to be available at the local mobility anchor.
   Learning the access network operator identity may not be possible for
   a local mobility anchor without a support of a additional policy
   framework that is able to provide required information out of band to
   the local mobility anchor.  Such a policy framework may not be
   required for all Proxy Mobile IPv6 deployments and hence an
   alternative approach for optionally carrying such information is
   required to ensure that additional information related to the access
   network is available.

   This document defines a new mobility option, the Access Network
   Identifier (ANI) option and its sub-options for Proxy Mobile IPv6,
   that can be used by the mobile access gateway to signal the access
   network information to the local mobility anchor.  The specific
   details on how the local mobility anchor uses the information
   contained in the Access Network Identifier option are out-of-scope
   for this document.  This information is intended for use between
   infrastructure nodes providing mobile management service and SHOULD
   NOT be exposed to outside entities.  This mobility option is optional



Gundavelli, et al.      Expires January 17, 2013                [Page 3]

Internet-Draft      Access Network Identifier Option           July 2012


   and is not mandatory for the Proxy Mobile IPv6 protocol.  However,
   the Access Technology Type option continues to be a mandatory option
   and it always needs to be carried in the Proxy Mobile IPv6 signaling
   messages.

       SSID: IETF-1
       Geo-location: 37o49'11"N 122o28'43"W
       Operator-Id: provider1.example.com
       +--+
       |AP|-------.                        {Access Specific Policies)
       +--+       |             _-----_             |
                +-----+       _(       )_        +-----+
                | MAG |-=====(   PMIPv6  )======-| LMA |-
                +-----+       (_ Tunnel_)        +-----+
       +--+       |             '-----'
       |AP|-------'
       +--+
       SSID: IETF-2
       Geo-location: 59o19'40.21"N  18o 3'18.36"E
       Operator-Id: provider2.example.com

                 Figure 1: Access Networks attached to MAG

   Figure 1 illustrates an example Proxy Mobile IPv6 deployment where
   the mobile access gateway delivers the information elements related
   to the access network to the local mobility anchor over Proxy Mobile
   IPv6 signaling messages.  In this example, the additional information
   could comprise the SSID of the used IEEE 802.11 network, the geo-
   location of the network to which the mobile node is attached, and the
   identities of the operators running the IEEE 802.11 access network
   infrastructure.


2.  Conventions and Terminology

2.1.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

2.2.  Terminology

   All the mobility related terms used in this document are to be
   interpreted as defined in the Proxy Mobile IPv6 specifications
   [RFC5213] and [RFC5844].  Additionally, this document uses the
   following abbreviations:




Gundavelli, et al.      Expires January 17, 2013                [Page 4]

Internet-Draft      Access Network Identifier Option           July 2012


   Service Set Identifier

      Service Set Identifier (SSID) identifies the name of the IEEE
      802.11 network.  SSID differentiates from one network to the
      other.

   Operator ID

      The Operator ID is the SMI Network Management Private Enterprise
      Code of the IANA-maintained Private Enterprise Numbers registry
      [SMI].


3.  Access Network Identifier Option

   The Access Network Identifier option is a mobility header option used
   to exchange access network related information between a local
   mobility anchor and a mobile access gateway.  The option can be
   included in both Proxy Binding Update (PBU) and Proxy Binding
   Acknowledgement (PBA) messages, and there MUST NOT be more than a
   single instance of this mobility option in a mobility message.  The
   Access Network Identifier mobility option MUST contain one or more
   Access Network Identifier Sub-options.  The Access Network Identifier
   Sub-option is described in Section 3.1.

   The alignment requirement for this option is 4n [RFC2460].


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Type     |   Length      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                  ...      ANI Sub-option(s) ...                   ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 2: Access Network Identifier Option

   Type:  It MUST be set to value of (IANA-1) (to be defined by IANA),
      indicating that its a Network-Identifier option.

   Length:  8-bit unsigned integer indicating the length in octets of
      the option, excluding the type and length fields.







Gundavelli, et al.      Expires January 17, 2013                [Page 5]

Internet-Draft      Access Network Identifier Option           July 2012


3.1.  Format of the Access Network Identifier Sub-Option

   The Access Network Identifier Sub-Options are used for carrying
   information elements related to the access network to which the
   mobile node is attached to.  These sub-options can be included in the
   Access Network Identifier option defined in Section 3.  The format of
   this sub-option is as follows:


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    ANI Type   | ANI Length    |         Option Data           ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


              Figure 3: Access Network Identifier Sub-Option

   ANI Type:  8-bit unsigned integer indicating the type of the Access
      Network Identifier sub-option.  This specification defines the
      following types:

      0 -  Reserved

      1 -  Network-Identifier Sub-option

      2 -  Geo-Location Sub-option

      3 -  Operator-Identifier Sub-option

   ANI Length:  8-bit unsigned integer indicating the number of octets
      needed to encode the Option Data, excluding the ANI Type and ANI
      Length fields of the sub-option.

3.1.1.  Network-Identifier Sub-Option

   The Network-Identifier is a mobility sub-option carried in the Access
   Network Identifier option defined in Section 3.  This sub-option
   carries the name of the access network (e.g., a SSID in case of IEEE
   802.11 Access Network, or PLMN Identifier [TS23003] in case of 3GPP
   access), to which the mobile node is attached.  There MUST be no more
   than a single instance of this specific sub-option in any Access
   Network Identifier option.  The format of this option is defined
   below.







Gundavelli, et al.      Expires January 17, 2013                [Page 6]

Internet-Draft      Access Network Identifier Option           July 2012


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | ANI Type=1    |  ANI Length   |E|   Reserved  | Net-Name Len  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     Network Name (e.g., SSID or PLMNID)       ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | AP-Name Len   |        Access-Point Name                      ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 4: Network-Identifier Sub-option

   ANI Type:  It MUST be set to value of (1), indicating that its a
      Network-Identifier sub-option

   ANI Length:  Total length of this sub option, excluding the ANI Type
      and ANI length fields.  The value can be in the range of 5 to 32
      octets.

   'E'-bit:  1-bit flag for representing the encoding of the following
      name field.  MUST be set to zero (0) if the network name is
      encoded using a string of opaque 8-bit octets or to one (1) if the
      network name is encoded using UTF-8 [RFC3629].

   Reserved:  MUST be set to zero when sending and ignored when
      received.

   Net-Name Length:  8-bit field for representing the length of the
      network name to be followed.  This field MUST NOT be set to zero.

   Network Name:  The name of the access network to which the mobile
      node is attached.  The type of the network-name is dependent on
      the Access Technology to which the mobile node is attached.  If
      its 802.11 access, the network-name MUST be the SSID of the
      network.  If the access network is 3GPP access, the network-name
      is the PLMN Identifier of the network.  If the access network is
      3GPP2 access, the network-name is the Access Network Identifier
      [ANI].

      When encoding the PLMN Identifier, both Mobile Network Code (MNC)
      [TS23003] and Mobile Country Code (MCC) [TS23003] codes MUST be 3
      digits.  If the MNC in use only has 2 digits, then it MUST be
      preceded with a '0'.  Encoding MUST be UTF-8.







Gundavelli, et al.      Expires January 17, 2013                [Page 7]

Internet-Draft      Access Network Identifier Option           July 2012


   AP-Name Length:  8-bit field for representing the length of the
      access point name to be followed.  If the access point name is not
      included, then this length MUST be set to a value of zero.

   Access-Point Name:  The name of the access point (physical device
      name) to which the mobile node is attached.  This is the
      identifier that uniquely identifies the access point.  In some
      deployments the name can be set to the mac-address of the device.
      The string is carried in UTF-8 representation.

3.1.2.  Geo-Location ANI Sub-Option

   The Geo-Location is a mobility sub-option carried in the Access
   Network Identifier option defined in Section 3.  This sub-option
   carries the Geo-location of the network to which the mobile node is
   attached, as known to the mobile access gateway.  There MUST be no
   more than a single instance of this specific sub-option in any Access
   Network Identifier option.  The format of this option is defined
   below.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  ANI Type=2   | ANI Length=8  |N|     Latitude Degrees        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  La-Minutes   | La-Seconds    |E|     Longitude Degrees       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Lo-Minutes   | Lo-Seconds    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                   Figure 5: Geo-Location ANI sub-option

   ANI Type:  It MUST be set to value of (2), indicating that its Geo-
      Location sub-option

   ANI Length:  Total length of this sub-option, excluding the ANI Type
      and ANI length fields.  It MUST be set to a value of (8).

   N: When the flag (N) is set to a value of (1), it means North, else
      it means South

   Latitude Degrees:  MUST be a value between 0 to 90; northern or
      southern hemisphere as qualified by the (N) flag






Gundavelli, et al.      Expires January 17, 2013                [Page 8]

Internet-Draft      Access Network Identifier Option           July 2012


   La-Minutes:  MUST be a value between 0 to 59.

   La-Seconds:  MUST be a value between 0 to 59.  Any fractional values
      MUST be rounded off to the nearest integer.

   E: When the flag (E) is set to a value of (1), it means East, else it
      means West

   Longitude Degrees:  MUST be a value between 0 to 90; eastern or
      western hemisphere as qualified by the (E) flag

   Lo-Minutes:  MUST be a value between 0 to 59.

   Lo-Seconds:  MUST be a value between 0 to 59..  Any fractional values
      MUST be rounded off to the nearest integer.

3.1.3.  Operator-Identifier Sub-Option

   The Operator-Identifier is a mobility sub-option carried in the
   Access Network Identifier option defined in Section 3.  This sub-
   option carries the operator identifier of the access network to which
   the mobile node is attached.  There MUST be no more than a single
   instance of this specific sub-option in any Access Network Identifier
   option.  The format of this option is defined below.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | ANI Type=3    |    ANI Length   |   Op-ID Type  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                            Operator Identifier                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



                 Figure 6: Operator-Identifier Sub-option

   ANI Type:  It MUST be set to value of (3), indicating that its
      Operator-Identifier sub-option

   ANI Length:  Total length of this sub option, excluding the ANI Type
      and ANI length fields.

   Operator Identifier (Op-ID) Type:  8-bit unsigned integer indicating
      the type of the Operator Identifier.  Currently the following
      types are defined:




Gundavelli, et al.      Expires January 17, 2013                [Page 9]

Internet-Draft      Access Network Identifier Option           July 2012


      0 -  Reserved.

      1 -  Operator ID as a four octet Private Enterprise Number [SMI].

      2 -  Realm of the operator.  Realm names are required to be
         unique, and are piggybacked on the administration of the DNS
         namespace.  Realms are encoded using a domain name encoding
         defined in [RFC1035].

   Operator Identifier:  Up to 253 octets of the operator identifier.
      The encoding of the identifier depends on the used Operator-ID
      Type.  Numeric values are encoded in network byte order and
      strings are in UTF-8 representation and have no terminating '\0'
      mark.


4.  Protocol Considerations

   The following considerations apply to the local mobility anchor and
   the mobile access gateway.

4.1.  Mobile Access Gateway Considerations

   o  The conceptual Binding Update List entry data structure maintained
      by the mobile access gateway, described in Section 6.1 of
      [RFC5213], MUST be extended to store the access network related
      information elements associated with the current session.
      Specifically, the following parameters MUST be defined.

      Network-Identifier

      Access-Point-Name

      Operator-Identifier

      Geo-Location

   o  If the mobile access gateway is configured to support Access
      Network Information option, it SHOULD include this option with the
      specific sub-options in all Proxy Binding Update messages
      (including in Proxy Binding Updates for lifetime extension and for
      deregistration) that it sends to the local mobility anchor.  The
      Access Network Information option MUST be constructed as specified
      in Section 3.  It SHOULD include the ANI sub-option(s) that the
      mobile access gateway is configured to carry in the Proxy Mobile
      IPv6 messages.





Gundavelli, et al.      Expires January 17, 2013               [Page 10]

Internet-Draft      Access Network Identifier Option           July 2012


   o  The access network information elements, such as Access Network
      Name, Geo-location and the Operator Identifier, typically are
      statically configured on the mobile access gateway on a per-
      interface basis (Example: Access Point (AP-1) is attached through
      interface-1, and the SSID is X, Geo-Location is Y).  In some
      deployments, this information can also be dynamically obtained,
      such as through DHCP Option (82), which is the DHCP Relay Agent
      Information option [RFC3046].  When the mobile node sends a DHCP
      Request, the Access Points typically add the SSID information to
      the Option 82 of the DHCP request and when the mobile access
      gateway receives this request, it can parse the Option 82 of the
      DHCP request and obtain the SSID name.  The mobility access
      gateway can also obtain this information from the DHCPv6 GeoLoc
      Option [RFC6225].  The specific details on how the mobile access
      gateway obtains these information elements are access technology
      and deployment specific, and is out-side the scope of this
      document.  It is possible those information elements are
      configured on the MAG on a per-interface basis, or dynamically
      obtained through some of out-of-band means, such as based on
      CAPWAP protocol.

   o  If the protocol configuration variable,
      EnableANISubOptNetworkIdentifier (Section 6), is set to a value of
      (1), the mobile access gateway SHOULD include the Network-
      Identifier sub-option in the Access Network Identifier option
      carried in the Proxy Binding Update.  However, if the mobile
      access gateway is unable to obtain the network identifier, then it
      MUST NOT include this sub-option.  For including the Network-
      Identifier sub-option, the mobile access gateway needs to be aware
      of the network name of the access network (Ex: SSID in case WLAN
      Access Network) to which the mobile node is attached.  This sub-
      option also includes the access-point name for carrying the name
      of the access point to which the mobile node is attached.  The
      access-point name is specially important for applying location
      services and given that the network-name (Ex: SSID) may not
      provide the needed uniqueness for identifying a location.  This
      sub-option when included MUST be constructed as described in
      Section 3.1.1

   o  If the protocol configuration variable, EnableANISubOptGeoLocation
      (Section 6), is set to a value of (1), the mobile access gateway
      SHOULD include the Geo-Location sub-option in the Access Network
      Identifier option carried in the Proxy Binding Update.  However,
      if the mobile access gateway is unable to obtain the Geo-location,
      then it MUST NOT include this sub-option.  For including the Geo-
      Location sub-option, the mobile access gateway needs to be aware
      of the GPS coordinates of the network to which the mobile node is
      attached.  This sub-option when included MUST be constructed as



Gundavelli, et al.      Expires January 17, 2013               [Page 11]

Internet-Draft      Access Network Identifier Option           July 2012


      described in Section 3.1.2.

   o  If the protocol configuration variable,
      EnableANISubOptOperatorIdentifier (Section 6), is set to a value
      of (1), the mobile access gateway SHOULD include the Operator-
      Identifier sub-option in the Access Network Identifier option
      carried in the Proxy Binding Update.  For including the Operator-
      Identifier sub-option, the mobile access gateway needs to be aware
      of the operator identity of that access network.  If a given
      access network operator has not obtained an identifier from the
      Private Enterprise Number registry, or if the mobile access
      gateway is unable to obtain the operator identity for any other
      reason, then it MUST NOT include this sub-option.  This sub-option
      when included MUST be constructed as described in Section 3.1.3.

   If the mobile access gateway had any of the Access Network
   Information mobility option included the Proxy Binding Update sent to
   a local mobility anchor, then the Proxy Binding Acknowledgement
   received from the local mobility anchor SHOULD contain the Access
   Network Information mobility option with the specific sub-options.
   If the mobile access gateway receives a Proxy Binding Acknowledgement
   with a successful Status Value but without an Access Network
   Information mobility option, then the mobile access gateway SHOULD
   log the event and based on its local policy MAY proceed to terminate
   the mobility session.  In this case the mobile access gateway knows
   the local mobility anchor does not understand the Access Network
   Information mobility option and therefore MAY consider it as a
   misconfiguration of the Proxy Mobile IPv6 domain.

4.2.  Local Mobility Anchor Considerations

   o  The conceptual Binding Cache entry data structure maintained by
      the local mobility anchor, described in Section 5.1 of [RFC5213],
      MUST be extended to store the access network related information
      elements associated with the current session.  Specifically, the
      following parameters MUST be defined.

      Network-Identifier

      Access Point Name

      Operator-Identifier

      Geo-Location

   o  On receiving a Proxy Binding Update message [RFC5213] from a
      mobile access gateway with the Access Network Information option,
      the local mobility anchor must process the option and update the



Gundavelli, et al.      Expires January 17, 2013               [Page 12]

Internet-Draft      Access Network Identifier Option           July 2012


      corresponding fields in the Binding Cache entry.  If the option is
      not understood by that LMA implementation, it will skip the
      option.

   o  If the local mobility anchor understands the Access Network
      Identifier mobility option received in a Proxy Binding Update and
      also supports the sub-option(s), then the local mobility anchor
      MUST echo the Access Network Identifier mobility option with the
      specific sub-option(s) that it accepted back to a mobile access
      gateway in a Proxy Binding Acknowledgement.  The Access Network
      Identifier sub-options defined in this specification MUST NOT be
      altered by the local mobility anchor.

   o  If the received Proxy Binding Update message does not include the
      Access Network Information option, then the mobility session
      associated with that Proxy Binding Update MUST be updated to
      remove any access network information elements.

   o  The local mobility anchor MAY choose to use the access network
      information sub-options for applying any access operator specific
      handling or policing of the mobile node traffic.  The specific
      details on how these sub-options are used is outside the scope of
      this document.


5.  IANA Considerations

   This document requires the following IANA actions.

   o  Action-1: This specification defines a new Mobility Header option,
      the Access Network Identifier.  This mobility option is described
      in Section 3.  The Type value for this option needs to be assigned
      from the same numbering space as allocated for the other mobility
      options, as defined in [RFC6275].

   o  Action-2: This specification defines a new mobility sub-option
      format, Access Network Information (ANI) sub-option.  The format
      of this mobility sub-option is described in Section 3.1.  This
      sub-option can be carried in Access Network Information option.
      The type value for this sub-option needs to be managed by IANA,
      under the Registry, Access Network Information sub-option.  This
      specification reserves the following type values.  Approval of new
      Access Network Information (ANI) sub-option type values are to be
      made through IANA Expert Review.







Gundavelli, et al.      Expires January 17, 2013               [Page 13]

Internet-Draft      Access Network Identifier Option           July 2012


   +=========================================================+
   | 0 | Reserved                                            |
   +=========================================================+
   | 1 | Network-Identifier Sub-option                       |
   +=========================================================+
   | 2 | Geo-Location Sub-option                             |
   +=========================================================+
   | 3 | Operator-Identifier Sub-option                      |
   +=========================================================+


   o  Action-3: This specification defines a new mobility sub-option,
      Operator-Identifier sub-option.  The format of this mobility sub-
      option is described in Section 3.1.3.  The Operator Identifier
      (Op-Id) Type field of this sub-option introduces a new number
      space.  This number space needs to be managed by IANA, under the
      Registry, Operator Identifier Type Registry.  This specification
      reserves the following type values.  Approval of new Operator
      Identifier Type values are to be made through IANA Expert Review.


   +=========================================================+
   | 0 | Reserved                                            |
   +===+=====================================================+
   | 1 | Operator ID as a four octet Private Ent. Number     |
   +===+=====================================================+
   | 2 | Realm of the Operator                               |
   +===+=====================================================+



6.  Protocol Configuration Variables

   This specification defines the following configuration variables that
   control the use of Access Network Information related sub-options in
   Proxy Mobile IPv6 signaling messages.  The mobility entities, local
   mobility anchor and the mobile access gateway MUST allow these
   variables to be configured by the system management.  The configured
   values for these protocol variables MUST survive server reboots and
   service restarts.

   EnableANISubOptNetworkIdentifier

         This flag indicates the operational state of the Network-
         Identifier sub-option support.  This configuration variable is
         available at both in the mobile access gateway and at the local
         mobility anchor.  The default value for this flag is set to
         (0), indicating that the support for Network-Identifier sub-



Gundavelli, et al.      Expires January 17, 2013               [Page 14]

Internet-Draft      Access Network Identifier Option           July 2012


         option is disabled.

         When this flag on the mobile access gateway is set to a value
         of (1), the mobile access gateway SHOULD include this sub-
         option in the Proxy Binding Update messages that it sends to
         the local mobility anchor, otherwise it SHOULD NOT include the
         sub-option.  There can be situations where the mobile access
         gateway is unable to obtain the network-identifier and may not
         be able to construct this sub-option.

         Similarly, when this flag on the local mobility anchor is set
         to a value of (1), the local mobility anchor SHOULD enable
         support for this sub-option, otherwise it SHOULD ignore this
         sub-option.

   EnableANISubOptGeoLocation

         This flag indicates the operational state of the Geo-Location
         sub-option support.  This configuration variable is available
         at both in the mobile access gateway and at the local mobility
         anchor.  The default value for this flag is set to (0),
         indicating that the support for Geo-Location sub-option is
         disabled.

         When this flag on the mobile access gateway is set to a value
         of (1), the mobile access gateway SHOULD include this sub-
         option in the Proxy Binding Update messages that it sends to
         the local mobility anchor, otherwise it SHOULD NOT include the
         sub-option.  There can be situations where the mobile access
         gateway is unable to obtain the geo-location information and
         may not be able to construct this sub-option.

         Similarly, when this flag on the local mobility anchor is set
         to a value of (1), the local mobility anchor SHOULD enable
         support for this sub-option, otherwise it SHOULD ignore this
         sub-option.

   EnableANISubOptOperatorIdentifier

         This flag indicates the operational state of the Operator-
         Identifier sub-option support.  This configuration variable is
         available at both in the mobile access gateway and at the local
         mobility anchor.  The default value for this flag is set to
         (0), indicating that the support for Operator-Identifier sub-
         option is disabled.






Gundavelli, et al.      Expires January 17, 2013               [Page 15]

Internet-Draft      Access Network Identifier Option           July 2012


         When this flag on the mobile access gateway is set to a value
         of (1), the mobile access gateway SHOULD include this sub-
         option in the Proxy Binding Update messages that it sends to
         the local mobility anchor, otherwise it SHOULD NOT include the
         sub-option.  There can be situations where the mobile access
         gateway is unable to obtain the operator-identifier information
         and may not be able to construct this sub-option.

         Similarly, when this flag on the local mobility anchor is set
         to a value of (1), the local mobility anchor SHOULD enable
         support for this sub-option, otherwise it SHOULD ignore this
         sub-option.


7.  Security Considerations

   The Access Network Information option defined in this specification
   is for use in Proxy Binding Update and Proxy Binding Acknowledgement
   messages.  This option is carried like any other mobility header
   option as specified in [RFC6275] and does not require any special
   security considerations.

   The Geo-location sub-option carried in the Access Network Information
   option exposes the geo-location of the mobile node as presented by
   the mobile access gateway and this information is considered to be
   very sensitive.  Care must be taken to secure the Proxy Mobile IPv6
   signaling messages when carrying this sub-option.  The base Proxy
   Mobile IPv6 specification [RFC6275] specifies the use of IPsec for
   securing the signaling messages and those mechanisms can be enabled
   for protecting this information.


8.  Acknowledgements

   The authors would like to thank Basavaraj Patil, Carlos Bernardos,
   Gerardo Gieratta, Eric Voit, Hidetoshi Yokota, Ryuji Wakikawa,
   Sangram Kishore, William Wan, Stefano Faccin and Brian Haberman for
   all the discussions related to this topic.  The authors would also
   like to acknowledge the IESG reviews from Benoit Claise, Stephen
   Farrell, Pete Resnick, Robert Spark and Ralph Droms.


9.  References

9.1.  Normative References

   [RFC1035]  Mockapetris, P., "Domain names - implementation and
              specification", STD 13, RFC 1035, November 1987.



Gundavelli, et al.      Expires January 17, 2013               [Page 16]

Internet-Draft      Access Network Identifier Option           July 2012


   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3629]  Yergeau, F., "UTF-8, a transformation format of ISO
              10646", STD 63, RFC 3629, November 2003.

   [RFC5213]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K.,
              and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

   [RFC5844]  Wakikawa, R. and S. Gundavelli, "IPv4 Support for Proxy
              Mobile IPv6", RFC 5844, May 2010.

   [RFC6275]  Perkins, C., Johnson, D., and J. Arkko, "Mobility Support
              in IPv6", RFC 6275, July 2011.

9.2.  Informative References

   [ANI]      3GPP2 TSG-A, "Interoperability Specification (IOS) for
              High Rate Packet Data (HRPD) Radio Access Network
              Interfaces with Session Control in the Access Network",
              A.S0008-A v3.0, October 2008.

   [RFC2460]  Deering, S. and R. Hinden, "Internet Protocol, Version 6
              (IPv6) Specification", RFC 2460, December 1998.

   [RFC3046]  Patrick, M., "DHCP Relay Agent Information Option",
              RFC 3046, January 2001.

   [RFC6225]  Polk, J., Linsner, M., Thomson, M., and B. Aboba, "Dynamic
              Host Configuration Protocol Options for Coordinate-Based
              Location Configuration Information", RFC 6225, July 2011.

   [SMI]      IANA, "PRIVATE ENTERPRISE NUMBERS", SMI Network Management
              Private Enterprise Codes, February 2011.

   [TS23003]  3GPP, "Numbering, addressing and identification", 2012.

   [TS23203]  3GPP, "Policy and Charging Control Architecture", 2012.

   [TS23402]  3GPP, "Architecture enhancements for non-3GPP accesses",
              2012.










Gundavelli, et al.      Expires January 17, 2013               [Page 17]

Internet-Draft      Access Network Identifier Option           July 2012


Authors' Addresses

   Sri Gundavelli (editor)
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sgundave@cisco.com


   Jouni Korhonen (editor)
   Nokia Siemens Networks
   Linnoitustie 6
   Espoo  FIN-02600
   Finland

   Email: jouni.nospam@gmail.com


   Mark Grayson
   Cisco
   11 New Square Park
   Bedfont Lakes, FELTHAM  TW14 8HA
   ENGLAND

   Email: mgrayson@cisco.com


   Kent Leung
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: kleung@cisco.com


   Rajesh Pazhyannur
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: rpazhyan@cisco.com






Gundavelli, et al.      Expires January 17, 2013               [Page 18]

